
if [ $1 -ge $(( $2 + $3 )) ] || [ $2 -ge $(( $1 + $3 )) ] || [ $3 -ge $(( $2 + $1 )) ]; then
	echo "Это не треугольник"
	exit 1;
elif [ $(( $1 * $1 )) = $(( $(( $2 * $2 )) + $(( $3 * $3 )) )) ] || [ $(( $2 * $2 )) = $(( $(( $1 * $1 )) + $(( $3 * $3 )) )) ] || [ $(( $3 * $3 )) = $(( $(( $2 * $2 )) + $(( $1 * $1 )) )) ]; then
	echo "Это прямоугольный треугольник";
	exit 1;
elif [ $1 = $2 ] && [ $2 = $3 ] && [ $3 = $1 ];  then
	echo "Это равносторонний треугольник";
	exit 1;
elif [ $1 = $2 ] || [ $2 = $3 ] || [ $3 = $1 ]; then
	echo "Это равнобедренный треугольник";
	exit 1;
fi
